Documents/УстановкаСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаСчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СчетчикиБоксов</xr:Item>
				<xr:Item>InformationRegister.СчетчикиВводов</xr:Item>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиВводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиВводов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаСчетчика/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Счетчик.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ЭтоОбщий = Счетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
	
	Если ЭтоОбщий И Ввод.Пустая() Тогда
		Сообщить("Для общего счётчика укажите ввод.");
		Отказ = Истина;
	КонецЕсли;
	Если Не ЭтоОбщий И Бокс.Пустая() Тогда
		Сообщить("Для индивидуального счетчика укажите бокс.");
		Отказ = Истина;
	КонецЕсли;
	Если НачальноеПоказание < 0 Тогда
		Сообщить("Начальное показание не может быть отрицательным.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Счетчик.Пустая() Тогда
		Сообщить("Не указан счётчик.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭтоОбщий = Счетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
	МоментДо = Дата - 1;
	
	//--- контроли --- 	
	ЗанятыйБокс = ЭлектроУчет.БоксСчетчикаНаДату(Счетчик, МоментДо);
	Если Не ЗанятыйБокс.Пустая() Тогда
		Сообщить("Счётчик уже числится на боксе " + Строка(ЗанятыйБокс) + ".");
		Отказ = Истина;	
	КонецЕсли;
	ЗанятыйВвод = ЭлектроУчет.ВводСчетчикаНаДату(Счетчик, МоментДо);
	Если Не ЗанятыйВвод.Пустая() Тогда
		Сообщить("Счётчик уже числится на вводе " + Строка(ЗанятыйВвод) + ".");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЭтоОбщий Тогда
		УжеСтоит = ЭлектроУчет.СчетчикБоксаНаДату(Бокс, МоментДо);
	Иначе
		УжеСтоит = ЭлектроУчет.СчетчикВводаНаДату(Ввод, МоментДо);
	КонецЕсли;	
	Если Не УжеСтоит.Пустая() Тогда
		Сообщить("На месте установки уже стоит счётчик " + Строка(УжеСтоит)
		+ " – оформите документ ""Замена счетчика"".");
		Отказ = Истина;		
	КонецЕсли; 
	Если Не ЭтоОбщий Тогда
		Если ЭлектроУчет.ЕстьОперацииСБоксомВДату(Бокс, Дата, Ссылка) Тогда
			Сообщить("С этим боксом в ту же дату уже есть документ установки/замены.");
			Отказ = Истина;
		КонецЕсли;
	Иначе 
		Если ЭлектроУчет.ЕстьОперацииСВводомВДату(Ввод, Дата, Ссылка) Тогда
			Сообщить("С этим вводом в ту же дату уже есть документ установки/замены.");
		КонецЕсли;
	КонецЕсли;
	
	// Счётчик при повторной установке продолжает счёт с прошлого места:
	// начальное показание не может быть меньше последнего показания.
	ПоследнееПоказание = ЭлектроУчет.ТекущееПоказаниеЧисло(Счетчик, МоментДо);
	//Если НачальноеПоказание < ПоследнееПоказание Тогда
	//	Сообщить("Начальное показание (" + НачальноеПоказание + ") меньше последнего показания счётчика (" + 
	//	ПоследнееПоказание + "). Электронный счётчик не обнуляется - проверьте ввод.");
	//   Отказ = Истина;
	//   КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//--- движения ---
	Движения.ТекущиеПоказания.Записывать = Истина;
	Движение = Движения.ТекущиеПоказания.Добавить();
	Движение.Период = Дата;
	Движение.Счетчик = Счетчик;
	Движение.Показание = НачальноеПоказание;
	
	Если Не ЭтоОбщий Тогда
		Движения.СчетчикиБоксов.Записывать = Истина;
		Движение = Движения.СчетчикиБоксов.Добавить();
		Движение.Период = Дата;
		Движение.Бокс = Бокс;
		Движение.Счетчик = Счетчик;
	Иначе
		Движения.СчетчикиВводов.Записывать = Истина;
		Движение = Движения.СчетчикиВводов.Добавить();
		Движение.Период = Дата;
		Движение.Ввод = Ввод;
		Движение.Счетчик = Счетчик;
	КонецЕсли; 
КонецПроцедуры
